
El fichero ~Ejemplo.tex~ debe ser compilado con ~lualatex~ para
obtener una version en ~pdf~ así como el fichero con extensión ~.xml~
que se debe importar al banco de preguntas de Moodle.

* Compilación                                                      :noexport:
#+begin_src bash :results verbatim
lualatex Ejemplo.tex  
#+end_src

#+RESULTS:
#+begin_example
This is LuaHBTeX, Version 1.12.0 (TeX Live 2020/Debian) 
 restricted system commands enabled.
(./Ejemplo.tex
LaTeX2e <2020-10-01> patch level 4
 L3 programming layer <2021-01-09> xparse <2020-03-03>
(/usr/share/texlive/texmf-dist/tex/latex/base/article.cls
Document Class: article 2020/04/10 v1.4m Standard LaTeX document class
(/usr/share/texlive/texmf-dist/tex/latex/base/size10.clo))
(/usr/share/texlive/texmf-dist/tex/latex/base/inputenc.sty

Package inputenc Warning: inputenc package ignored with utf8 based engines.

) (/usr/share/texlive/texmf-dist/tex/latex/base/fontenc.sty
(/usr/share/texmf/tex/latex/lm/t1lmr.fd))
(/usr/share/texlive/texmf-dist/tex/generic/babel/babel.sty
(/usr/share/texlive/texmf-dist/tex/generic/babel/babel.def
(/usr/share/texlive/texmf-dist/tex/generic/babel/luababel.def)
(/usr/share/texlive/texmf-dist/tex/generic/babel/luababel.def))
(/usr/share/texlive/texmf-dist/tex/generic/babel-spanish/spanish.ldf
(/usr/share/texlive/texmf-dist/tex/generic/hyph-utf8/loadhyph/loadhyph-es.tex
UTF-8 Spanish hyphenation patterns
(/usr/share/texlive/texmf-dist/tex/generic/hyph-utf8/patterns/tex/hyph-es.tex))
)) (./nacal-moodle.sty
(/usr/share/texlive/texmf-dist/tex/latex/moodle/moodle.sty
(/usr/share/texlive/texmf-dist/tex/latex/environ/environ.sty
(/usr/share/texlive/texmf-dist/tex/latex/trimspaces/trimspaces.sty))
(/usr/share/texlive/texmf-dist/tex/latex/xkeyval/xkeyval.sty
(/usr/share/texlive/texmf-dist/tex/generic/xkeyval/xkeyval.tex
(/usr/share/texlive/texmf-dist/tex/generic/xkeyval/xkvutils.tex
(/usr/share/texlive/texmf-dist/tex/generic/xkeyval/keyval.tex))))
(/usr/share/texlive/texmf-dist/tex/latex/amsfonts/amssymb.sty
(/usr/share/texlive/texmf-dist/tex/latex/amsfonts/amsfonts.sty))
(/usr/share/texlive/texmf-dist/tex/latex/etex-pkg/etex.sty)
(/usr/share/texlive/texmf-dist/tex/latex/etoolbox/etoolbox.sty)
(/usr/share/texlive/texmf-dist/tex/latex/xpatch/xpatch.sty
(/usr/share/texlive/texmf-dist/tex/latex/l3kernel/expl3.sty
(/usr/share/texlive/texmf-dist/tex/latex/l3backend/l3backend-luatex.def))
(/usr/share/texlive/texmf-dist/tex/latex/l3packages/xparse/xparse.sty
(/usr/share/texlive/texmf-dist/tex/latex/l3packages/xparse/xparse-generic.tex))
) (/usr/share/texlive/texmf-dist/tex/latex/tools/array.sty)
(/usr/share/texlive/texmf-dist/tex/latex/ifplatform/ifplatform.sty
(/usr/share/texlive/texmf-dist/tex/latex/tools/shellesc.sty)
(/usr/share/texlive/texmf-dist/tex/generic/pdftexcmds/pdftexcmds.sty
(/usr/share/texlive/texmf-dist/tex/generic/infwarerr/infwarerr.sty)
(/usr/share/texlive/texmf-dist/tex/generic/iftex/iftex.sty)
(/usr/share/texlive/texmf-dist/tex/generic/ltxcmds/ltxcmds.sty))
(/usr/share/texlive/texmf-dist/tex/generic/catchfile/catchfile.sty
(/usr/share/texlive/texmf-dist/tex/generic/etexcmds/etexcmds.sty))
(/usr/share/texlive/texmf-dist/tex/generic/iftex/ifluatex.sty))
(/usr/share/texlive/texmf-dist/tex/latex/fancybox/fancybox.sty
Style option: `fancybox' v1.4 <2010/05/15> (tvz)
) (/usr/share/texlive/texmf-dist/tex/latex/getitems/getitems.sty)
(/usr/share/texmf/tex/latex/lm/t1lmtt.fd))
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsmath.sty
For additional information on amsmath, use the `?' option.
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amstext.sty
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsgen.sty))
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsbsy.sty)
(/usr/share/texlive/texmf-dist/tex/latex/amsmath/amsopn.sty))
(/usr/share/texlive/texmf-dist/tex/latex/xcolor/xcolor.sty
(/usr/share/texlive/texmf-dist/tex/latex/graphics-cfg/color.cfg)
(/usr/share/texlive/texmf-dist/tex/latex/graphics-def/luatex.def)))
(./notacionLinAlg.latex
(/usr/share/texlive/texmf-dist/tex/latex/tools/xspace.sty)
(/usr/share/texlive/texmf-dist/tex/latex/leftidx/leftidx.sty)
(/usr/share/texlive/texmf-dist/tex/latex/pict2e/pict2e.sty
(/usr/share/texlive/texmf-dist/tex/latex/pict2e/pict2e.cfg)
(/usr/share/texlive/texmf-dist/tex/latex/pict2e/p2e-luatex.def)
(/usr/share/texlive/texmf-dist/tex/latex/graphics/trig.sty))
(/usr/share/texlive/texmf-dist/tex/latex/esvect/esvect.sty)
(/usr/share/texlive/texmf-dist/tex/latex/stackengine/stackengine.sty
(/usr/share/texlive/texmf-dist/tex/generic/listofitems/listofitems.sty
(/usr/share/texlive/texmf-dist/tex/generic/listofitems/listofitems.tex))
(/usr/share/texlive/texmf-dist/tex/latex/tools/calc.sty)))
(/usr/share/texlive/texmf-dist/tex/latex/geometry/geometry.sty
(/usr/share/texlive/texmf-dist/tex/generic/iftex/ifvtex.sty)) (./Ejemplo.aux)
(/usr/share/texlive/texmf-dist/tex/latex/base/ts1cmr.fd)
(/usr/share/texlive/texmf-dist/tex/context/base/mkii/supp-pdf.mkii
[Loading MPS to PDF converter (version 2006.09.02).]
)
,*geometry* driver: auto-detecting
,*geometry* detected driver: luatex
(/usr/share/texlive/texmf-dist/tex/latex/amsfonts/umsa.fd)
(/usr/share/texlive/texmf-dist/tex/latex/amsfonts/umsb.fd)
(/usr/share/texlive/texmf-dist/tex/latex/esvect/uesvect.fd)
(/usr/share/texlive/texmf-dist/tex/latex/amsfonts/ueuf.fd) [1{/var/lib/texmf/fo
nts/map/pdftex/updmap/pdftex.map}] (./Ejemplo.aux))
 548 words of node memory still in use:
   7 hlist, 2 vlist, 2 rule, 1 dir, 4 glue, 4 kern, 1 glyph, 12 attribute, 56 g
lue_spec, 8 attribute_list, 1 write nodes
   avail lists: 1:84,2:3284,3:427,4:405,5:968,6:425,7:2760,8:254,9:2240,10:92,1
1:95,12:77
{/usr/share/texmf/fonts/enc/dvips/lm/lm-ec.enc}</usr/share/texlive/texmf-dist/f
onts/type1/public/amsfonts/cm/cmex10.pfb></usr/share/texlive/texmf-dist/fonts/t
ype1/public/amsfonts/cm/cmmi10.pfb></usr/share/texlive/texmf-dist/fonts/type1/p
ublic/amsfonts/cm/cmmi5.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/a
msfonts/cm/cmmi7.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/amsfonts
/cm/cmmib10.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/amsfonts/cmex
tra/cmmib5.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/amsfonts/cmext
ra/cmmib7.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/amsfonts/cm/cmr
10.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/amsfonts/cm/cmr5.pfb><
/usr/share/texlive/texmf-dist/fonts/type1/public/amsfonts/cm/cmr7.pfb></usr/sha
re/texlive/texmf-dist/fonts/type1/public/amsfonts/cm/cmss10.pfb></usr/share/tex
live/texmf-dist/fonts/type1/public/amsfonts/cm/cmss8.pfb></usr/share/texlive/te
xmf-dist/fonts/type1/public/amsfonts/cm/cmssbx10.pfb></usr/share/texlive/texmf-
dist/fonts/type1/public/amsfonts/cm/cmsy10.pfb></usr/share/texlive/texmf-dist/f
onts/type1/public/amsfonts/cm/cmsy5.pfb></usr/share/texlive/texmf-dist/fonts/ty
pe1/public/amsfonts/cm/cmsy7.pfb></usr/share/texlive/texmf-dist/fonts/type1/pub
lic/amsfonts/euler/eufm5.pfb></usr/share/texlive/texmf-dist/fonts/type1/public/
amsfonts/latxfont/lcirclew.pfb></usr/share/texmf/fonts/type1/public/lm/lmbx10.p
fb></usr/share/texmf/fonts/type1/public/lm/lmbx12.pfb></usr/share/texmf/fonts/t
ype1/public/lm/lmcsc10.pfb></usr/share/texmf/fonts/type1/public/lm/lmr10.pfb></
usr/share/texmf/fonts/type1/public/lm/lmr5.pfb></usr/share/texlive/texmf-dist/f
onts/type1/public/amsfonts/symbols/msam10.pfb></usr/share/texlive/texmf-dist/fo
nts/type1/public/amsfonts/symbols/msam5.pfb></usr/share/texlive/texmf-dist/font
s/type1/public/amsfonts/symbols/msam7.pfb></usr/share/texlive/texmf-dist/fonts/
type1/public/amsfonts/symbols/msbm10.pfb></usr/share/texlive/texmf-dist/fonts/t
ype1/public/esvect/vect10.pfb>
Output written on Ejemplo.pdf (1 page, 278486 bytes).
Transcript written on Ejemplo.log.
#+end_example
